{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 32, 32, 3], "trainable": true, "b_constraint": null, "border_mode": "same", "bias": true, "name": "convolution2d_1", "subsample": [1, 1], "nb_filter": 32, "nb_col": 3, "activity_regularizer": null, "input_dtype": "float32", "b_regularizer": null, "activation": "relu", "W_constraint": {"m": 3, "name": "MaxNorm", "axis": 0}, "dim_ordering": "th", "init": "glorot_uniform", "nb_row": 3, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "border_mode": "same", "bias": true, "trainable": true, "subsample": [1, 1], "b_constraint": null, "nb_col": 3, "activity_regularizer": null, "name": "convolution2d_2", "W_constraint": {"m": 3, "name": "MaxNorm", "axis": 0}, "activation": "relu", "b_regularizer": null, "dim_ordering": "th", "init": "glorot_uniform", "nb_row": 3, "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_1", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "input_dim": null, "bias": true, "output_dim": 512, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "activation": "relu", "W_constraint": {"m": 3, "name": "MaxNorm", "axis": 0}, "name": "dense_1", "W_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "input_dim": null, "bias": true, "output_dim": 3, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "activation": "softmax", "W_constraint": null, "name": "dense_2", "W_regularizer": null}}]}