{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"activation": "relu", "nb_row": 3, "activity_regularizer": null, "name": "convolution2d_1", "subsample": [1, 1], "input_dtype": "float32", "W_regularizer": null, "border_mode": "same", "bias": true, "dim_ordering": "th", "W_constraint": {"axis": 0, "m": 3, "name": "MaxNorm"}, "b_constraint": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "nb_filter": 32, "nb_col": 3, "batch_input_shape": [null, 32, 32, 3]}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "nb_row": 3, "activity_regularizer": null, "name": "convolution2d_2", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "bias": true, "dim_ordering": "th", "W_constraint": {"axis": 0, "m": 3, "name": "MaxNorm"}, "b_constraint": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "nb_filter": 32, "nb_col": 3}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_1", "trainable": true, "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "output_dim": 512, "activity_regularizer": null, "name": "dense_1", "W_regularizer": null, "input_dim": null, "bias": true, "W_constraint": {"axis": 0, "m": 3, "name": "MaxNorm"}, "b_constraint": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"activation": "softmax", "output_dim": 3, "activity_regularizer": null, "name": "dense_2", "W_regularizer": null, "input_dim": null, "bias": true, "W_constraint": null, "b_constraint": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform"}}]}