{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "nb_col": 3, "activation": "relu", "dim_ordering": "th", "b_constraint": null, "nb_filter": 32, "bias": true, "batch_input_shape": [null, 32, 32, 3], "input_dtype": "float32", "nb_row": 3, "init": "glorot_uniform", "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "W_constraint": {"m": 3, "name": "MaxNorm", "axis": 0}, "W_regularizer": null, "name": "convolution2d_1", "subsample": [1, 1]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "Convolution2D", "config": {"trainable": true, "nb_col": 3, "activation": "relu", "dim_ordering": "th", "b_constraint": null, "nb_filter": 32, "bias": true, "activity_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "b_regularizer": null, "border_mode": "same", "W_constraint": {"m": 3, "name": "MaxNorm", "axis": 0}, "W_regularizer": null, "name": "convolution2d_2", "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "dim_ordering": "th", "strides": [2, 2], "pool_size": [2, 2], "name": "maxpooling2d_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 512, "activation": "relu", "init": "glorot_uniform", "bias": true, "b_regularizer": null, "input_dim": null, "activity_regularizer": null, "W_constraint": {"m": 3, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "W_regularizer": null, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 3, "activation": "softmax", "init": "glorot_uniform", "bias": true, "b_regularizer": null, "input_dim": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "name": "dense_2"}}], "keras_version": "1.1.2"}