{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "batch_input_shape": [null, 32, 32, 3], "b_constraint": null, "name": "convolution2d_1", "b_regularizer": null, "nb_col": 3, "nb_row": 3, "activity_regularizer": null, "dim_ordering": "th", "border_mode": "same", "activation": "relu", "W_constraint": {"m": 3, "axis": 0, "name": "MaxNorm"}, "input_dtype": "float32", "W_regularizer": null, "subsample": [1, 1], "trainable": true, "nb_filter": 32, "bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "name": "convolution2d_2", "b_regularizer": null, "nb_col": 3, "nb_row": 3, "border_mode": "same", "dim_ordering": "th", "activation": "relu", "W_constraint": {"m": 3, "axis": 0, "name": "MaxNorm"}, "W_regularizer": null, "subsample": [1, 1], "trainable": true, "nb_filter": 32, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "dim_ordering": "th", "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"output_dim": 512, "activity_regularizer": null, "b_constraint": null, "name": "dense_1", "b_regularizer": null, "activation": "relu", "init": "glorot_uniform", "W_constraint": {"m": 3, "axis": 0, "name": "MaxNorm"}, "W_regularizer": null, "input_dim": null, "trainable": true, "bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"output_dim": 43, "activity_regularizer": null, "b_constraint": null, "name": "dense_2", "b_regularizer": null, "activation": "softmax", "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "input_dim": null, "trainable": true, "bias": true}}]}